// Задача 29: Напишите программу, которая 
// задаёт массив из 8 элементов (псевдослучайных)
// и выводит их на экран.
// 1, 2, 5, 7, 19, 6, 1, 33 -> [1, 2, 5, 7, 19, 6, 1, 33]

int[] array = new int[8]; // объявляем новый массив из 8 дэфолтных элеметов (0)

RandomFillArray(array); // вызываем метод заполнения массива псевдослучайными числами от 0 до 99
PrintArray(array); // вызываем метод печати массива в формате [1, 2, 3, 4]

//================================================================================
// Метод заполнения массива псевдослучайными числами от 0 до 99
void RandomFillArray (int[] arr)
{
    int length = arr.Length;
    Random rnd = new Random();
    for (int i = 0; i < length; i++)
    {
        arr[i] = rnd.Next(0, 100);
    }
}

//================================================================================
// Метод печати массива в формате [1, 2, 3, 4]
void PrintArray (int[] arr)
{
    int length = arr.Length;
    Console.Write("[");
    for (int i = 0; i < length; i++)
    {
        Console.Write(arr[i]);
        if (i < length - 1) Console.Write(", ");
    }
    Console.Write("]");
}
